Revit 2018 API
StructuralSectionLAngle Constructor (Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double, Double)
 Creates a new instance of Structural Section L Angle shape with the associated set of parameters, used to attach to structural element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.0)
Since: 2015
Syntax
C#
[ObsoleteAttribute("This constructor is obsolete and will be removed in a future version of Revit. Use constructor with additional topWebFillet parameter instead.")]
public StructuralSectionLAngle(
	double width,
	double height,
	double flangeThickness,
	double webThickness,
	double webFillet,
	double flangeFillet,
	double centroidHorizontal,
	double centroidVertical,
	double principalAxesAngle,
	double sectionArea,
	double perimeter,
	double nominalWeight,
	double momentOfInertiaStrongAxis,
	double momentOfInertiaWeakAxis,
	double elasticModulusStrongAxis,
	double elasticModulusWeakAxis,
	double plasticModulusStrongAxis,
	double plasticModulusWeakAxis,
	double torsionalMomentOfInertia,
	double torsionalModulus,
	double warpingConstant,
	double shearAreaStrongAxis,
	double shearAreaWeakAxis,
	double boltSpacing1LongerFlange,
	double boltSpacing2LongerFlange,
	double boltSpacingShorterFlange,
	double boltDiameterLongerFlange,
	double boltDiameterShorterFlange
)
Visual Basic
<ObsoleteAttribute("This constructor is obsolete and will be removed in a future version of Revit. Use constructor with additional topWebFillet parameter instead.")> _
Public Sub New ( _
	width As Double, _
	height As Double, _
	flangeThickness As Double, _
	webThickness As Double, _
	webFillet As Double, _
	flangeFillet As Double, _
	centroidHorizontal As Double, _
	centroidVertical As Double, _
	principalAxesAngle As Double, _
	sectionArea As Double, _
	perimeter As Double, _
	nominalWeight As Double, _
	momentOfInertiaStrongAxis As Double, _
	momentOfInertiaWeakAxis As Double, _
	elasticModulusStrongAxis As Double, _
	elasticModulusWeakAxis As Double, _
	plasticModulusStrongAxis As Double, _
	plasticModulusWeakAxis As Double, _
	torsionalMomentOfInertia As Double, _
	torsionalModulus As Double, _
	warpingConstant As Double, _
	shearAreaStrongAxis As Double, _
	shearAreaWeakAxis As Double, _
	boltSpacing1LongerFlange As Double, _
	boltSpacing2LongerFlange As Double, _
	boltSpacingShorterFlange As Double, _
	boltDiameterLongerFlange As Double, _
	boltDiameterShorterFlange As Double _
)
Visual C++
[ObsoleteAttribute(L"This constructor is obsolete and will be removed in a future version of Revit. Use constructor with additional topWebFillet parameter instead.")]
public:
StructuralSectionLAngle(
	double width,
	double height,
	double flangeThickness,
	double webThickness,
	double webFillet,
	double flangeFillet,
	double centroidHorizontal,
	double centroidVertical,
	double principalAxesAngle,
	double sectionArea,
	double perimeter,
	double nominalWeight,
	double momentOfInertiaStrongAxis,
	double momentOfInertiaWeakAxis,
	double elasticModulusStrongAxis,
	double elasticModulusWeakAxis,
	double plasticModulusStrongAxis,
	double plasticModulusWeakAxis,
	double torsionalMomentOfInertia,
	double torsionalModulus,
	double warpingConstant,
	double shearAreaStrongAxis,
	double shearAreaWeakAxis,
	double boltSpacing1LongerFlange,
	double boltSpacing2LongerFlange,
	double boltSpacingShorterFlange,
	double boltDiameterLongerFlange,
	double boltDiameterShorterFlange
)
Parameters
width
Type: System.Double
 Section width.
height
Type: System.Double
 Section height, depth.
flangeThickness
Type: System.Double
 Flange Thickness.
webThickness
Type: System.Double
 Web Thickness.
webFillet
Type: System.Double
 Web Fillet - fillet radius between web and flange.
flangeFillet
Type: System.Double
 Flange Fillet - fillet radius at the flange end.
centroidHorizontal
Type: System.Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical
Type: System.Double
 Distance from centroid to the upper extremites along vertical axis.
principalAxesAngle
Type: System.Double
 Rotation angle between the principal axes and cross section reference planes.
sectionArea
Type: System.Double
 Cross section area.
perimeter
Type: System.Double
 Painting surface of the unit length.
nominalWeight
Type: System.Double
 Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.
momentOfInertiaStrongAxis
Type: System.Double
 Moment of Inertia about main strong axis (I).
momentOfInertiaWeakAxis
Type: System.Double
 Moment of Inertia about main weak axis (I).
elasticModulusStrongAxis
Type: System.Double
 Elastic section modulus about main strong axis for calculation of bending stresses.
elasticModulusWeakAxis
Type: System.Double
 Elastic section modulus about main weak axis for calculation of bending stresses.
plasticModulusStrongAxis
Type: System.Double
 Plastic section modulus in bending about main strong axis (Z, Wpl)
plasticModulusWeakAxis
Type: System.Double
 Plastic section modulus in bending about main weak axis.
torsionalMomentOfInertia
Type: System.Double
 Torsional Moment of inertia (J, IT, K), for calculation of torsional deformation
torsionalModulus
Type: System.Double
 Section modulus for calculations of torsion stresses (Ct)
warpingConstant
Type: System.Double
 Warping constant (Cw, Iomega, H)
shearAreaStrongAxis
Type: System.Double
 Shear area (reduced extreme shear stress coefficient) in the direction of strong axis (Wq).
shearAreaWeakAxis
Type: System.Double
 Shear area (reduced extreme shear stress coefficient) in the direction of weak axis (Wq).
boltSpacing1LongerFlange
Type: System.Double
 Standard bolt spacing first row in the longer flange, in. (mm)
boltSpacing2LongerFlange
Type: System.Double
 Standard bolt spacing second row in the longer flange, in. (mm)
boltSpacingShorterFlange
Type: System.Double
 Standard bolt spacing in the shorter flangI-split Parallel Flangee, in. (mm)
boltDiameterLongerFlange
Type: System.Double
 Maximum bolt hole diameter in the longer flange, in. (mm)
boltDiameterShorterFlange
Type: System.Double
 Maximum bolt hole diameter in the shorter flange, in. (mm)
See Also
StructuralSectionLAngle Class
StructuralSectionLAngle Overload
Autodesk.Revit.DB.Structure.StructuralSections Namespace